/**
 *****************************************
 * Created by lifx
 * Created on 2018-03-10 17:17:35
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 生成加载器
 *****************************************
 */
export default load(require.context('./lib'));


/**
 *****************************************
 * 加载模块
 *****************************************
 */
function load(importer = require) {
    return function use(name) {
        return importer('./' + name + '.js');
    };
}
